apps/contributions/tests/fixtures/customer-subscription-deleted-webhook.json

{
    "id": "evt_fakefakefake",
    "object": "event",
    "account": "acct_fakefakefake",
    "api_version": "2020-08-27",
    "created": 1673018247,
    "data": {
      "object": {
        "id": "sub_fakefakefake",
        "object": "subscription",
        "application": "ca_fakefakefakefake",
        "application_fee_percent": null,
        "automatic_tax": {
          "enabled": false
        },
        "billing_cycle_anchor": 1663773174,
        "billing_thresholds": null,
        "cancel_at": null,
        "cancel_at_period_end": false,
        "canceled_at": 1673018247,
        "collection_method": "charge_automatically",
        "created": 1663773174,
        "currency": "usd",
        "current_period_end": 1674313974,
        "current_period_start": 1671635574,
        "customer": "cus_MTRUJ5nMGZ5ldM",
        "days_until_due": null,
        "default_payment_method": "pm_fakefakefake",
        "default_source": null,
        "default_tax_rates": [
        ],
        "description": null,
        "discount": null,
        "ended_at": 1673018247,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_fakefakefake",
              "object": "subscription_item",
              "billing_thresholds": null,
              "created": 1663773174,
              "metadata": {
              },
              "plan": {
                "id": "price_fakefakefake",
                "object": "plan",
                "active": false,
                "aggregate_usage": null,
                "amount": 23957,
                "amount_decimal": "23957",
                "billing_scheme": "per_unit",
                "created": 1663773174,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_fakefakefake",
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "price": {
                "id": "price_fakefakefake",
                "object": "price",
                "active": false,
                "billing_scheme": "per_unit",
                "created": 1663773174,
                "currency": "usd",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_fakefakefake",
                "recurring": {
                  "aggregate_usage": null,
                  "interval": "month",
                  "interval_count": 1,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "recurring",
                "unit_amount": 23957,
                "unit_amount_decimal": "23957"
              },
              "quantity": 1,
              "subscription": "sub_fakefakefake",
              "tax_rates": [
              ]
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_fakefakefake"
        },
        "latest_invoice": "in_fakefakefake",
        "livemode": false,
        "metadata": {
          "agreed_to_pay_fees": "False",
          "referer": "https://foo.org/donate",
          "source": "rev-engine",
          "revenue_program_id": "22",
          "donor_selected_amount": "23957",
          "swag_opt_out": "False",
          "contributor_id": "425",
          "revenue_program_slug": "foo",
          "schema_version": "1.1"
        },
        "next_pending_invoice_item_invoice": null,
        "on_behalf_of": null,
        "pause_collection": null,
        "payment_settings": {
          "payment_method_options": null,
          "payment_method_types": null,
          "save_default_payment_method": "on_subscription"
        },
        "pending_invoice_item_interval": null,
        "pending_setup_intent": null,
        "pending_update": null,
        "plan": {
          "id": "price_fakefakefake",
          "object": "plan",
          "active": false,
          "aggregate_usage": null,
          "amount": 23957,
          "amount_decimal": "23957",
          "billing_scheme": "per_unit",
          "created": 1663773174,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": null,
          "product": "prod_fakefakefake",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "schedule": null,
        "start_date": 1663773174,
        "status": "canceled",
        "test_clock": null,
        "transfer_data": null,
        "trial_end": null,
        "trial_start": null
      }
    },
    "livemode": false,
    "pending_webhooks": 15,
    "request": {
      "id": "req_fakefakefake",
      "idempotency_key": null
    },
    "type": "customer.subscription.deleted"
  }
