apps/contributions/tests/fixtures/customer-subscription-updated-webhook.json

{
    "id": "evt_fakefakefake",
    "object": "event",
    "account": "acct_fakefakefake",
    "api_version": "2020-08-27",
    "created": 1672964931,
    "data": {
      "object": {
        "id": "sub_fakefakefake",
        "object": "subscription",
        "application": "ca_fakefakefake",
        "application_fee_percent": null,
        "automatic_tax": {
          "enabled": false
        },
        "billing_cycle_anchor": 1672964927,
        "billing_thresholds": null,
        "cancel_at": null,
        "cancel_at_period_end": false,
        "canceled_at": 1672964931,
        "collection_method": "charge_automatically",
        "created": 1672964927,
        "currency": "usd",
        "current_period_end": 1675643327,
        "current_period_start": 1672964927,
        "customer": "cus_fakefakefake",
        "days_until_due": null,
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [
        ],
        "description": null,
        "discount": null,
        "ended_at": 1672964931,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_fakefakefake",
              "object": "subscription_item",
              "billing_thresholds": null,
              "created": 1672964927,
              "metadata": {
              },
              "plan": {
                "id": "price_fakefakefake",
                "object": "plan",
                "active": false,
                "aggregate_usage": null,
                "amount": 37352,
                "amount_decimal": "37352",
                "billing_scheme": "per_unit",
                "created": 1672964927,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_fakefakefake",
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "price": {
                "id": "price_fakefakefake",
                "object": "price",
                "active": false,
                "billing_scheme": "per_unit",
                "created": 1672964927,
                "currency": "usd",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_fakefakefake",
                "recurring": {
                  "aggregate_usage": null,
                  "interval": "month",
                  "interval_count": 1,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "recurring",
                "unit_amount": 37352,
                "unit_amount_decimal": "37352"
              },
              "quantity": 1,
              "subscription": "sub_fakefakefake",
              "tax_rates": [
              ]
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_fakefakefake"
        },
        "latest_invoice": "in_1MN3nfPbhdfvD1kVyiI1mKlR",
        "livemode": false,
        "metadata": {
          "referer": "https://foo.revengine-staging.org/",
          "donor_selected_amount": "365.0",
          "revenue_program_id": "3",
          "source": "rev-engine",
          "swag_opt_out": "False",
          "contributor_id": "132",
          "agreed_to_pay_fees": "True",
          "revenue_program_slug": "foo",
          "schema_version": "1.1"
        },
        "next_pending_invoice_item_invoice": null,
        "on_behalf_of": null,
        "pause_collection": null,
        "payment_settings": {
          "payment_method_options": null,
          "payment_method_types": null,
          "save_default_payment_method": "on_subscription"
        },
        "pending_invoice_item_interval": null,
        "pending_setup_intent": null,
        "pending_update": null,
        "plan": {
          "id": "price_fakefakefake",
          "object": "plan",
          "active": false,
          "aggregate_usage": null,
          "amount": 37352,
          "amount_decimal": "37352",
          "billing_scheme": "per_unit",
          "created": 1672964927,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {
          },
          "nickname": null,
          "product": "prod_fakefakefake",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "schedule": null,
        "start_date": 1672964927,
        "status": "incomplete_expired",
        "test_clock": null,
        "transfer_data": null,
        "trial_end": null,
        "trial_start": null
      },
      "previous_attributes": {
        "canceled_at": null,
        "ended_at": null,
        "status": "incomplete"
      }
    },
    "livemode": false,
    "pending_webhooks": 14,
    "request": {
      "id": "req_fakefakefake",
      "idempotency_key": null
    },
    "type": "customer.subscription.updated"
  }
