apps/contributions/tests/fixtures/payment-intent-canceled-webhook.json

{
    "id": "evt_fakefakefake",
    "object": "event",
    "account": "acct_fakefakefake",
    "api_version": "2020-08-27",
    "created": 1672964931,
    "data": {
      "object": {
        "id": "pi_fakefakefake",
        "object": "payment_intent",
        "amount": 37352,
        "amount_capturable": 0,
        "amount_details": {
          "tip": {
          }
        },
        "amount_received": 0,
        "application": "ca_fakefakefake",
        "application_fee_amount": null,
        "automatic_payment_methods": null,
        "canceled_at": 1672964931,
        "cancellation_reason": "void_invoice",
        "capture_method": "automatic",
        "charges": {
          "object": "list",
          "data": [
          ],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges?payment_intent=pi_fakefakefake"
        },
        "client_secret": "pi_fakefakefake_secret_fakefakefake",
        "confirmation_method": "automatic",
        "created": 1672964927,
        "currency": "usd",
        "customer": "cus_fakefakefake",
        "description": "Subscription creation",
        "invoice": "in_fakefakefake",
        "last_payment_error": null,
        "livemode": false,
        "metadata": {
        },
        "next_action": null,
        "on_behalf_of": null,
        "payment_method": null,
        "payment_method_options": {
          "card": {
            "installments": null,
            "mandate_options": null,
            "network": null,
            "request_three_d_secure": "automatic"
          }
        },
        "payment_method_types": [
          "card"
        ],
        "processing": null,
        "receipt_email": null,
        "review": null,
        "setup_future_usage": "off_session",
        "shipping": null,
        "source": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "canceled",
        "transfer_data": null,
        "transfer_group": null
      }
    },
    "livemode": false,
    "pending_webhooks": 14,
    "request": {
      "id": "req_fakefakefake",
      "idempotency_key": null
    },
    "type": "payment_intent.canceled"
  }
